remarks_project_detail <- tagList(
    
    br(),
    
    h4(strong("はじめに")),
    p("このページでは、特定の審査区分、研究種目における採択課題の特徴を様々な角度から深掘りすることができます。具体的には、以下の５つの観点から分析することができます"),
    tags$ul(
        tags$li("研究代表者の職位"),
        tags$li("研究期間"),
        tags$li("直接経費の総額"),
        tags$li("研究分担者数"),
        tags$li("キーワード")
    ),
    
    br(),
    
    h4(strong("使い方")),
    tags$ul(
        tags$li("集計対象の研究機関や期間（年度）、審査区分、研究種目を選び、「Apply Filter」ボタンを押すとグラフと集計表が表示されます"),
        tags$li("上部のタブから上記の分析の観点を切り替えることができます"),
    ),
    
    
    
    
    
    
    
    
    
    
)