# ======================================================================
#
# パッケージ
#
# ======================================================================

library(dplyr)
library(DT)
library(data.table)
library(stringr)
library(purrr)
library(tidyr)


# ======================================================================
#
# 審査区分の整理と出力
#
# ======================================================================

# 審査区分表
kubun <- fread("kubun.csv", colClasses = rep("character", 5))

# 審査区分名の整理
kubun[, 中区分 := str_replace(中区分, "およびその関連分野", "")]
kubun[, 小区分 := str_replace(小区分, "関連$", "")]

# csvで書き出し
fwrite(kubun, "../99_InputData/review_section.csv")


# ======================================================================
#
# KAKENデータのインポートと統合
# （注：ダウンロードしたファイルの名前は自分で変えること）
# ======================================================================


# 実際のファイル名を以下に代入する
kaken.2018 <- "2018_20210318.csv"
kaken.2019 <- "2019_20210318.csv"
kaken.2020 <- "2020_20210318.csv"

# 必要な列
cols <- c("研究課題/領域番号", "研究代表者", "研究分担者", "審査区分", "研究種目", 
          "研究機関", "総配分額", "総配分額 (直接経費)", "キーワード", "研究期間 (年度)")

# 2018年度データのインポート
d2018 <- fread(kaken.2018, select = cols) 
d2018[, 年度 := 2018]

# 2019年度データのインポート
d2019 <- fread(kaken.2019, select = cols) 
d2019[, 年度 := 2019]

# 2020年度データのインポート
d2020 <- fread(kaken.2020, select = cols) 
d2020[, 年度 := 2020]


# データの統合と整理
DF <- rbind(d2018, d2019, d2020) 

# 列名の変更
setnames(DF, "研究課題/領域番号", "研究課題番号")
setnames(DF, "総配分額 (直接経費)", "直接経費")
setnames(DF, "研究期間 (年度)", "研究期間")


# ======================================================================
#
# KAKENマスターデータ（DF）の作成
# 
# ======================================================================

# 所属機関の整理
DF[, 所属機関 := str_replace(研究機関, "(^.+/ )(.+?)", "\\2")]
DF[, 所属機関 := str_replace(所属機関, "\\(.*\\)", "")]
DF[, 所属機関 := str_replace(所属機関, "^国立研究開発法人", "")]
DF[, 所属機関 := str_replace(所属機関, "^国立大学法人", "")]
DF[, 所属機関 := str_replace(所属機関, "^大学共同利用機関法人", "")]
DF[, 所属機関 := str_replace(所属機関, "^公益財団法人", "")]
DF[, 所属機関 := str_replace(所属機関, "^公益社団法人", "")]
DF[, 所属機関 := str_replace(所属機関, "^独立行政法人", "")]
DF[, 所属機関 := str_replace(所属機関, "^地方独立行政法人", "")]
DF[, 所属機関 := str_replace(所属機関, "^一般財団法人", "")]
DF[, 所属機関 := str_replace(所属機関, "^一般社団法人", "")]
DF[, 所属機関 := str_replace(所属機関, "^社会福祉法人", "")]
DF[, 所属機関 := str_replace(所属機関, "^特定非営利活動法人", "")]
DF[, 所属機関 := str_replace(所属機関, "^学校法人", "")]            
DF[, 所属機関 := str_replace(所属機関, "株式会社", "")] 
DF[, 所属機関 := str_replace_all(所属機関, "\\s", "")] 
DF[str_detect(所属機関, "防衛医科大学校"), 所属機関 := "防衛医科大学校"]
DF[str_detect(研究機関, "山梨県立病院機構山梨県立中央病院"), 所属機関 := "山梨県立病院機構山梨県立中央病院"]
DF[str_detect(研究機関, "大阪府保健医療財団大阪がん循環器病予防センター"), 所属機関 := "大阪府保健医療財団大阪がん循環器病予防センター"]
DF[str_detect(研究機関, "総合科学研究機構"), 所属機関 := "総合科学研究機構"]
DF[str_detect(研究機関, "大阪市博物館協会"), 所属機関 := "大阪市博物館協会"]
DF[str_detect(研究機関, "大阪市博物館機構"), 所属機関 := "大阪市博物館機構"]
DF[str_detect(研究機関, "自然科学研究機構"), 所属機関 := "自然科学研究機構"]
DF[str_detect(研究機関, "国立国語研究所"), 所属機関 := "国立国語研究所"]
DF[str_detect(研究機関, "神戸市民病院機構神戸市立医療センター中央市民病院"), 所属機関 := "神戸市民病院機構神戸市立医療センター中央市民病院"]
DF[, 所属機関 := str_trim(所属機関, side = "both")]

# 研究機関名の確認
DF[, 所属機関 %>% unique] %>% sort 

# 研究者番号の取得
DF[, 代表ID := str_extract(研究代表者, "\\d{8}")]

#職名の整理
DF[, 職名 := str_replace(研究代表者, "(^.+, )(.+?)", "\\2")]
DF[, 職名 := str_replace(職名, "\\(.+\\)", "")]
DF[, 職名 := ifelse(str_detect(職名, "助教"), "助教", 職名)]
DF[, 職名 := ifelse(str_detect(職名, "講師"), "講師", 職名)]
DF[, 職名 := ifelse(str_detect(職名, "准教授"), "准教授", 職名)]
DF[, 職名 := ifelse(str_detect(職名, "(?<!准)教授"), "教授", 職名)]
DF[, 職名 := ifelse(!str_detect(職名,"助教|講師|准教授|教授"), "その他", 職名)]
    
# 審査区分カテゴリー
DF[, 区分 := str_extract(審査区分, "大区分|中区分|小区分")]
    
# 審査区分コード
DF[, 区分コード := ifelse(str_detect(審査区分, "中区分|小区分"), str_extract(審査区分, "\\d+?(?=:)"), NA)]
DF[, 区分コード := ifelse(str_detect(審査区分, "大区分"), str_replace(審査区分, "大区分", ""), 区分コード)]
    
# 審査区分名の整理
DF[, 区分名 := ifelse(str_detect(審査区分, "大区分|中区分|小区分"), str_replace(審査区分, "^.+?:", ""), "その他")]
DF[, 区分名 := str_replace(区分名, "およびその関連分野$", "")]
DF[, 区分名 := str_replace(区分名, "関連$", "")]
    
# 研究期間の計算
interval <- function(x){
    str_extract_all(x, pattern = "\\d{4}") %>% unlist %>% as.numeric %>% diff
}

DF[str_detect(研究期間, "^\\d{4}$"), 年数 := 1]
DF[str_detect(研究期間, "\\d{4} – \\d{4}"), 年数 := map(研究期間, function(x) interval(x) + 1) %>% unlist]
DF[str_detect(研究期間, "\\d{4}-\\d{2}-\\d{2} – \\d{4}-\\d{2}-\\d{2}"), 年数 := map(研究期間, interval) %>% unlist]

# 研究分担者数の計算
DF[研究分担者 == "", 分担者数 := 0
        ][研究分担者 != "", 分担者数 := str_count(研究分担者, "\n") + 1]
    
# 不要な列の削除
DF[, c("研究期間", "研究機関", "研究代表者", "審査区分") := NULL]
    

# マスターデータの出力
DF[, !"研究分担者"] %>%
    fwrite("../99_InputData/DF_Master.csv")

# 研究種目一覧
fwrite(DF[order(研究種目), .(研究種目)] %>% unique, "../99_InputData/type_all.csv")

# 研究機関一覧
DF[order(所属機関), .(所属機関)
   ][所属機関 != ""] %>% unique %>%
    fwrite("../99_InputData/universities.csv")

# ======================================================================
#
# レーダーチャート用データ作成
# 
# ======================================================================

# 必要な列のみ選択
DF_radar <- DF[, .(年度, 研究課題番号, 所属機関, 研究種目, 直接経費, 区分, 区分コード, 区分名)]

# 小区分に中区分コードをマージ
DF_radar <- merge(DF_radar, 
                  kubun[, .(小区分, 中区分コード)] %>% unique, 
                  by.x = "区分名", by.y = "小区分", all.x = TRUE, allow.cartesian = T)
DF_radar[, 中区分コード := ifelse(区分 == "中区分", 区分コード, 中区分コード)]

# 大区分列作成
DF_radar <- merge(DF_radar, 
                  kubun[, .(中区分コード, 大区分)] %>% unique, 
                  by = "中区分コード", all.x = TRUE, allow.cartesian = T)
DF_radar[, 大区分 := ifelse(区分 == "大区分", 区分名, 大区分)]

# 必要な列のみ選択 
DF_radar <- DF_radar[区分 != "", .(年度, 研究課題番号, 所属機関, 研究種目, 直接経費, 区分, 中区分コード, 大区分)]

# csvで書き出し
fwrite(DF_radar, "../99_InputData/DF_Radar.csv")


# ======================================================================
#
# ネットワーク分析用のデータ作成
# 
# ======================================================================

# --------------------------------------------------------------
# 共同研究者列の展開と整理
# --------------------------------------------------------------

# 研究分担者を含む行のみを抽出
DF_network <- DF[研究分担者 != "", ]

# 研究分担者列の整理
DF_network[, 分担者 := str_split(研究分担者, "\n")] 

# 研究分担者列の展開
DF_network <- as.data.table(unnest(DF_network, 分担者))

# 研究分担者を整理
DF_network[, 分担ID := str_extract(分担者, "\\d{8}")]
DF_network[, 分担所属 := str_extract(分担者, "^.+?(?=,)")]
DF_network[, 分担所属 := str_replace(分担所属, "(^.+ )(.+$)", "\\2")]
DF_network[, 分担所属 := str_replace(分担所属, "^国立研究開発法人", "")]
DF_network[, 分担所属 := str_replace(分担所属, "^公益財団法人", "")]
DF_network[, 分担所属 := str_replace(分担所属, "^大学共同利用機関法人", "")]
DF_network[, 分担所属 := str_replace(分担所属, "^独立行政法人", "")]
DF_network[, 分担所属 := str_replace(分担所属, "^地方独立行政法人", "")]
DF_network[, 分担所属 := str_replace(分担所属, "^一般財団法人", "")]
DF_network[, 分担所属 := str_replace(分担所属, "株式会社", "")]
DF_network[, 分担所属 := str_trim(分担所属, side = "both")]

# 必要な列の選択
DF_network <- DF_network[ , .(研究課題番号, 研究種目, 年度, 区分, 区分名, 代表ID, 分担ID, 所属機関, 分担所属)]

#  研究者リストの書き出し 
Res.list <- rbind(
    DF_network[, .(研究課題番号, 研究種目, 区分名, 年度, ID = 代表ID, 所属 = 所属機関, 役割 = "代表")],
    DF_network[, .(研究課題番号, 研究種目, 区分名, 年度, ID = 分担ID, 所属 = 分担所属, 役割 = "分担")]) %>% unique

Res.list %>% fwrite("../99_InputData/researcher_net.csv")



# --------------------------------------------------------------
#  無向グラフデータの書き出し
# --------------------------------------------------------------

# 関数作成：１つの研究課題に参画する研究者の全ての組み合わせ
com <- function(x){
    c(x$代表ID, x$分担ID) %>%
        unique() %>%
        combn(2) %>%
        t %>%
        as.data.table()
}


# 関数の適用
DF_network <- DF_network[, .(data = list(com(.SD))), by = .(年度, 研究課題番号, 研究種目, 区分名)]
DF_network <- as.data.table(unnest(DF_network, data))

# グラフデータの書き出し
fwrite(DF_network, "../99_InputData/DF_Network.csv")

# ネットワーク用の研究種目リストを書き出し
DF_network[order(研究種目), .(研究種目)] %>% 
    unique %>%
    fwrite("../99_InputData/type_net.csv")
